In [1]:
import numpy as np
import pandas as pd

In [2]:
s=pd.Series([1,2,3,34,4],index=["a","b","c","d","e"])

In [5]:
s.idxmin()

'a'

In [6]:
s.idxmax()

'd'

In [9]:
s.duplicated()

a    False
b    False
c    False
d    False
e    False
dtype: bool

In [10]:
s=pd.Series([1,2,3,34,4],index=["a","b","c","d","a"])

In [11]:
s

a     1
b     2
c     3
d    34
a     4
dtype: int64

In [12]:
s["a"]

a    1
a    4
dtype: int64

In [15]:
s.index.is_unique

False

In [2]:
data=pd.read_csv("sample.csv")

In [3]:
data

    NAME   AGE   DEPT  SALARY
0    MARK   23    CSE   12000
1   MELLO   34    ECE   23000
2  JOSEPH   23     ME  340000
3    BERG   54    CSE   10000
4   KOHLI   23  CIVIL   23233
5    REMS   43    ECE   23432

In [4]:
data.groupby("DEPT")

In [9]:
k=data.groupby("DEPT")

In [11]:
k.max()

        NAME   AGE  SALARY
DEPT
CIVIL   KOHLI   23   23233
CSE      MARK   54   12000
ECE      REMS   43   23432
ME     JOSEPH   23  340000

k.mean()

In [13]:
k.mean()

        AGE    SALARY
DEPT
CIVIL  23.0   23233.0
CSE    38.5   11000.0
ECE    38.5   23216.0
ME     23.0  340000.0

In [14]:
k.median()

        AGE    SALARY
DEPT
CIVIL  23.0   23233.0
CSE    38.5   11000.0
ECE    38.5   23216.0
ME     23.0  340000.0

In [15]:
k.std()

             AGE       SALARY
DEPT
CIVIL        NaN          NaN
CSE    21.920310  1414.213562
ECE     6.363961   305.470129
ME           NaN          NaN

In [17]:
k.groups

{'CIVIL': Int64Index([4], dtype='int64'),
 'CSE': Int64Index([0, 3], dtype='int64'),
 'ECE': Int64Index([1, 5], dtype='int64'),
 'ME': Int64Index([2], dtype='int64')}

In [22]:

data["DEPT"].value_counts()

CSE      2
ECE      2
CIVIL    1
ME       1
Name: DEPT, dtype: int64